#define  _CRT_SECURE_NO_WARNINGS

//#include<stdio.h>


//隐式类型转换

// 什么时候进行整型提升
//1. 为了获得这个精度，表达式中的字符和短整型操作数在使用之前要转换为普通整型
//2. 通用CPU(generapurpose CPU)是难以置接实现两个8比特字节直接相加运算
// 所以，表达式中各种长度可能小于int长的整型值，都必须先转换为unsigned int或int，然后才能送入CPU去执行运算
// 
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));
//	printf("%u\n", sizeof(+c));
//	printf("%u\n", sizeof(!c));
//	return 0;
//}

//整形类型提升  
//转换为  int  型的
//即选取最高位 进行前补
//int main()
//{
//	char a = 3;  //00000011  进行整形提升
////	变为00000000000000000000000000000011
//	char b = 127;//01111111
////      00000000000000000000000001111111
//	char c = a + b;
////进行相加
//// 	   00000000000000000000000000000011
//// 	   00000000000000000000000001111111
////     00000000000000000000000010000010  
//// 	   结果放c后为10000010（char类型）
//// 	   打印的为%d  即为整形故c还要整形提升
////     11111111111111111111111110000010  补码
//// 	   11111111111111111111111110000001  反码
//// 	   10000000000000000000000001111110  原码
////     整形为-126
//	printf("%c\n", a);
//	printf("%c\n", b);
//	printf("%d\n", c);//打印的为%d  即为整形故c还要整形提升
//	return 0;
//}
